Get API event status, reflect current operation execution status.
  Namespace:   Autodesk.Revit.DB.Events
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public RevitAPIEventStatus Status { get; }
  Visual Basic
Public ReadOnly Property Status As RevitAPIEventStatus
	Get
  Visual C++
public:
property RevitAPIEventStatus Status {
	RevitAPIEventStatus get ();
}
 See Also
  WorksharedOperationProgressChangedEventArgs Class
  Autodesk.Revit.DB.Events Namespace